Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: Per exemple, si sabem que el substantiu anglés ski es tradueix per esquí i que la locució substantiva ski station es tradueix per estació d'esquí podem generalitzar aquesta última locució substituint ski per qualsevol altres substantiu $N$, de manera que la traducció de ``$N$ station'' és ``estació de $N$''; així, si la traducció de train és tren, la traducció de train station és estació de tren, etc.
es: Por ejemplo, si sabemos que el sustantivo inglés ski se traduce por esquí y que la locución sustantiva ski station se traduce por estación de esquí podemos generalizar esta última locución sustituyendo ski por cualquier otros sustantivo $N$, de forma que la traducción de ``$N$ station'' es ``estación de $N$''; así, si la traducción de train es tren, la traducción de train station es estación de tren, etc.

source: Per exemple, si usem el patró subst adj per a identificar una classe de sintagmes nominals senzills, podem fer que la traducció correcta al català del sintagma nominal espanyol { postre buenísimo} siga postres boníssimes, ja que el gènere i el nombre de l'adjectiu que modifica a un substantiu ha de concordar-hi i el substantiu espanyol postre (masculí singular) es correspon amb el substantiu català postres (femení plural).
es: Por ejemplo, si usamos el patrón sust adj para identificar una clase de sintagmas nominales sencillos, podemos hacer que la traducción correcta al catalán del sintagma nominal español { postre buenísimo} sea postres boníssimes, ya que el género y el número del adjetivo que modifica a un sustantivo tiene que concordar y el sustantivo español postre (masculino singular) se corresponde con el sustantivo catalán postres (femenino plural).

source: Per tant, apareix quasi mil vegades més freqüentment que l'atzar.
es: Por lo tanto, aparece casi mil veces más frecuentemente que el azar.

source: Per tant, els sistemes amb anàlisis més avançades (transferència semàntica, interlingua) també l'apliquen.
es: Por lo tanto, los sistemas con análisis más avanzados (transferencia semántica, interlingua) también lo aplican.

source: Per tant, si es tradueix aquesta oració amb un sistema de traducció automàtica indirecta per transferència sintàctica{}
es: Por lo tanto, si se traduce esta oración con un sistema de traducción automática indirecta por transferencia sintáctica{}

source: Perquè siga pràctic, l'algorisme d'anàlisi sintàctica ha de ser ràpid i eficient; per exemple, és convenient que funcione de manera que puga construir progressivament els arbres llegint l'oració d'esquerra a dreta, ja que així (a) pot començar a treballar abans que l'analitzador morfològic haja analitzat tota l'oració i (b) pot proveïr el mòdul de transferència amb anàlisis parcials que li poden servir per a anar preparant la traducció parcial de les parts ja analitzades.
es: Para que sea práctico, el algoritmo de análisis sintáctico tiene que ser rápido y eficiente; por ejemplo, es conveniente que funcione de manera que pueda construir progresivamente los árboles leyendo la oración de izquierda a derecha, ya que así (a) puede comenzar a trabajar antes que el analizador morfológico haya analizado toda la oración y (b) puede proveer el módulo de transferencia con análisis parciales que le pueden servir para ir preparando la traducción parcial de las partes ya analizadas.

source: Però els sistemes de transferència sintàctica no apliquen exactament el principi de composicionalitat, ja que es basen en l'aproximació que es poden traduir separadament: d'una banda, els mots (transferència lèxica) substituint-los pels seus equivalents i, d'altra banda, els arbres, transformant-ne l'estructura.
es: Pero los sistemas de transferencia sintáctica no aplican exactamente el principio de composicionalidad, puesto que se basan en la aproximación que se pueden traducir separadamente: por un lado, las palabras (transferencia léxica) sustituyéndolos por sus equivalentes y, por otro lado, los árboles, transformando la estructura.

source: Però hi ha mots que tendeixen a estar junts (col·locacions, unitats lèxiques multimot, unitats terminològiques) més que l'atzar.
es: Pero hay palabras que tienden a estar juntos (colocaciones, unidades léxicas multipalabra, unidades terminológicas) más que el azar.

source: Però les interlingües no han de ser necessàriament el resultat d'una anàlisi profunda: el que han de ser necessàriament és neutrals; per exemple, alguns sistemes com DLT [cap. 17]{hutchins92b} usen com a una llengua pivot ``natural'' com l'esperanto, amb anotacions que resolen algunes ambigüitats típiques.
es: Pero las interlinguas no tienen que ser necesariamente el resultado de un análisis profundo: lo que tienen que ser necesariamente es neutrales; por ejemplo, algunos sistemas como DLT [cap. 17]{hutchins92b} usan como una lengua pivot "natural'' como el esperanto, con anotaciones que resuelven algunas ambigüedades típicas.

source: Però per a això, cal identificar quines paraules són adjectius i substantius: la fase d'anàlisi es pot encarregar d'aquesta tasca perquè la fase de transferència puga aplicar regles generals sense preocupar-se de quins són els adjectius o els substantius concrets.
es: Pero para esto, es necesario identificar qué palabras son adjetivos y sustantivos: la fase de análisis se puede encargar de esta tarea para que la fase de transferencia pueda aplicar reglas generales sin preocuparse de cuáles son los adjetivos o los sustantivos concretos.

source: Però recentment (sobretot en els primers anys del tercer mil·leni) s'està produint un creixement espectacular de les aproximacions inductives a la traducció automàtica, en les quals el sistema aprén a traduir entre dues llengües $L_1$ i $L_2$ a partir d'una mostra o corpus suficientment gran de frases en $L_1$ acompanyades de la traducció a $L_2$ (vegeu l'apartat ).
es: Pero recientemente (sobre todo en los primeros años del tercer milenio) se está produciendo un crecimiento espectacular de las aproximaciones inductivas a la traducción automática, en las cuales el sistema aprende a traducir entre dos lenguas $L_1$ y $L_2$ a partir de una muestra o corpus suficientemente grande de frases en $L_1$ acompañadas de la traducción a $L_2$ (veáse el apartado ).

source: Però és que d'altra banda, la TA real es pot veure com un refinament necessari sobre el que es podria anomenar TA mot per mot (la qual processa l'entrada mot a mot i substitueix cada mot per un equivalent constant independent del context, preservant l'ordre dels mots).
es: Pero es que por otro lado, la TA real se puede ver como un refinamiento necesario sobre el que se podría denominar TA palabra por palabra (la cual procesa la entrada palabra a palabra y sustituye cada palabra por un equivalente constando independiente del contexto, preservando el orden de las palabras).

source: Peter nada {amb gust}.
es: Peter nada {con gusto}.

source: Peter s'estima nadant.
es: Peter se gusta nadando.

source: Podríeu explicar la causa d'aquesta variació?
es: ¿Podríais explicar la causa de esta variación?

source: Preedició, postedició, traducció per transferència, disseminació.
es: Preedición, postedición, traducción por transferencia, diseminación.

source: Primerament, elegiu un idioma meta (francés, anglés o alemany) i un idioma origen (català o espanyol).
es: Primeramente, elegid un idioma meta (francés, inglés o alemán) y un idioma origen (catalán o español).

source: Probablement ha dissenyat també un mòdul de preedició i el sistema elimina automàticament qualsevol causa d'ambigüitat.
es: Probablemente ha diseñado también un módulo de preedición y el sistema elimina automáticamente cualquier causa de ambigüedad.

source: Proposeu un conjunt de regles de reordenament que expliquen el conjunt de traduccions observat.
es: Proponed un conjunto de reglas de reordenamiento que explican el conjunto de traducciones observado.

source: Quan els mecanismes de flexió de les llengües són, com en la major part de les llengües indoeuropees, per modificació de les terminacions (desinències) dels mots, un mètode atractiu consisteix a processar la forma superficial lletra a lletra d'esquerra a dreta i produir la forma lèxica incrementalment, afegint a cada pas més informació.
es: Cuando los mecanismos de flexión de las lenguas son, como en la mayor parte de las lenguas indoeuropeas, por modificación de las terminaciones (desinencias) de las palabras, un método atractivo consiste en procesar la forma superficial letra a letra de izquierda a derecha y producir la forma léxica incrementalmente, añadiendo a cada paso más información.

source: Quan en una situació hi ha més d'una acció possible ---circumstància que pot ser deguda, com en l'exemple, al fet que la gramàtica és ambigua--- es pot fer una d'aquestes dues coses: elegir sempre una acció fixa o bé ``duplicar'' l'analitzador de manera que cada còpia continue l'anàlisi per cada un dels camins.
es: Cuando en una situación hay más de una acción posible ---circunstancia que puede ser debida, como en el ejemplo, al hecho que la gramática es ambigua--- se puede hacer una de estas dos cosas: elegir siempre una acción fija o bien "duplicar'' el analizador de forma que cada copia continúe el análisis por cada uno de los caminos.

source: Quan es tradueix de l'espanyol al català, poques vegades es donen situacions com aquesta, ja que, en general, l'ordre dels mots no sol canviar tan radicalment; una construcció espanyola que sí que podria requerir la identificació i el desplaçament d'un sintagma nominal complet per a traduir-lo al català seria la construcció de relatiu possessiu amb cuyo, ja que el català no en té.
es: Cuando se traduce del español al catalán, pocas veces se dan situaciones como esta, ya que, en general, el orden de las palabras no suele cambiar tan radicalmente; una construcción española que sí que podría requerir la identificación y el desplazamiento de un sintagma nominal completo para traducirlo al catalán sería la construcción de relativo posesivo con cuyo, ya que el catalán no tiene.

source: Quan la situació a la qual s'arriba no està prevista en la taula, és perquè l'oració no és correcta d'acord amb la gramàtica donada; aquesta situació d'error s'ha de resoldre de manera que l'anàlisi puga continuar, encara que el resultat siga una anàlisi parcial, ja que ens interessa produir una traducció aproximada; el tractament de les situacions d'error és complex i cau fora de l'abast d'aquest llibre.
es: Cuando la situación a la cual se llega no está prevista en la tabla, es porque la oración no es correcta de acuerdo con la gramática dada; esta situación de error se tiene que resolver de forma que el análisis pueda continuar, aunque el resultado sea un análisis parcial, puesto que nos interesa producir una traducción aproximada; el tratamiento de las situaciones de error es complejo y cae fuera del alcance de este libro.

source: Quan tenim més d'una regla, no sabem en quin ordre cal aplicar-les-hi.
es: Cuando tenemos más de una regla, no sabemos en qué orden hay que aplicarlas.

source: Quants mòduls d'anàlisi i de generació hem d'afegir en total a un sistema basat en transferència que ara mateix permet traduir entre 4 llengües, si volem incorporar-hi una llengua més de manera que el sistema puga traduir (tant en un sentit com en l'altre) entre totes les llengües existents i la nova?
es: ¿Cuántos módulos de análisis y de generación tenemos que añadir en total a un sistema basado en transferencia que ahora mismo permite traducir entre 4 lenguas, si queremos incorporar una lengua más de forma que el sistema pueda traducir (tanto en un sentido como en el otro) entre todas las lenguas existentes y la nueva?

source: Quants ordinadors hem de comprar?
es: ¿Cuántos ordenadores tenemos que comprar?

source: Queda clar que els mòduls d'anàlisi i de generació en aquests sistemes són més complexos que en el cas de transferència (ja que han de fer transformacions cap a estructures lingüísticament neutrals), però també és clar l'avantatge del sistema d'interlingua a l'hora d'afegir-hi la llengua $L_4$: només cal dissenyar dos mòduls nous, $A'_4$ i $G'_4$, i per a dissenyar-los només necessitem una persona que conega bé la llengua $L_4$ i la interlingua $I$ que usa el sistema.
es: Queda claro que los módulos de análisis y de generación en estos sistemas son más complejos que en el caso de transferencia (puesto que tienen que hacer transformaciones hacia estructuras lingüísticamente neutrales), pero también está claro la ventaja del sistema de interlingua a la hora de añadir la lengua $L_4$: sólo hay que diseñar dos módulos nuevos, $A'_4$ y $G'_4$, y para diseñarlos sólo necesitamos una persona que conozca bien la lengua $L_4$ y la interlingua $Y$ que usa el sistema.

source: Queda, a més, per determinar, en els casos en què es pot aplicar més d'una regla, quina s'hi ha d'aplicar abans.
es: Queda, además, por determinar, en los casos en que se puede aplicar más de una regla, y cuál se tiene que aplicar antes.

source: Quin dels següents tipus de sistema de traducció automàtica faciliten més l'addició d'una nova llengua?
es: ¿Cuál de los siguientes tipos de sistema de traducción automática facilitan más la adición de una nueva lengua?

source: Quin dels següents tipus de sistema de traducció automàtica tenen la fase de transferència més senzilla possible?
es: ¿Cua de los siguientes tipos de sistema de traducción automática tienen la fase de transferencia más sencilla posible?

source: Quina classe de sistema de traducció automàtica és LetTrans?
es: ¿Qué clase de sistema de traducción automática es LetTrans?

source: Quina és l'operació inversa de l'anàlisi morfològica?
es: ¿Cuál es la operación inversa del análisis morfológico?

source: Quines conseqüències té això per al disseny d'un sistema de traducció automàtica de transferència sintàctica entre llengües amb aquestes característiques?
es: ¿Qué consecuencias tiene esto para el diseño de un sistema de traducción automática de transferencia sintáctica entre lenguas con estas características?

source: Quines de les següents representacions intermèdies son més costoses d'obtenir a partir de les frases?
es: ¿Cuáles de las siguientes representaciones intermedias son más costosas de obtener a partir de las frases?

source: Quines són les fases bàsiques d'un sistema de traducció automàtica indirecta?
es: ¿Qué son las fases básicas de un sistema de traducción automática indirecta?

source: Qüestions, exercicis i problemes
es: Preguntas, ejercicios y problemas

source: REPRESENTACIÓ ABSTRACTA DEL TEXT META:
es: REPRESENTACIÓN ABSTRACTA DEL TEXTO META:

source: REPRESENTACIÓ ABSTRACTA DEL TEXT ORIGEN:
es: REPRESENTACIÓN ABSTRACTA DEL TEXTO ORIGEN:

source: Raoneu breument la resposta.
es: Razonad brevemente la respuesta.

source: Recordeu que els arbres d'anàlisi sintàctica estan ``cap per avall'': l'arrel és a dalt i les fulles, a baix.
es: Recordad que los árboles de análisis sintáctico están ``cabeza abajo": la raíz está arriba y las hojas, abajo.

source: Regles:
es: Reglas:

source: Resultat correcte.
es: Resultado correcto.

source: S'acostuma a representar la cadena buida $$ amb un zero (``{ 0}'').
es: Se acostumbra a representar la cadena vacía $$ con un cero (``{ 0}'').

source: S'assumeix que les primeres lletres del mot en són l'arrel i, per tant, determinen el lema, i que les últimes lletres determinen la forma gramatical.
es: Se asume que las primeras letras de la palabra son laraíz y, por lo tanto, determinan el lema, y que las últimas letras determinan la forma gramatical.

source: S'hi indiquen les traduccions i, entre claudàtors, la regla aplicada en cada cas: Un $[_{R_4$ longe viage $]$} $$ Un viatge llarg Un $[_{R_4$ longe viages $]$} $$ *Un viatges llargs $[_{R_2$ Un viages longe $]$} $$ Uns viatges llargs $[_{R_4$ Longe viages $]$} $$ Viatges llargs $[_{R_1$ Un governamento $]$ non democratic} $$ Un govern no democràtic $[_{R_1$ Un governamentos $]$ non democratic} $$ *Uns governs no democràtic Tu $[_{R_4$ melior ideales $]$} $$ *El teu millors ideals Un $[_{R_4$ bon solution $]$} $$ *Un bona solució
es: Se indican las traducciones y, entre corchetes, la regla aplicada en cada caso: Uno $[_{R_4$ longe viage $]$} $$ Un viaje largo Uno $[_{R_4$ longe viages $]$} $$ Un viajes largos $[_{R_2$ Un viages longe $]$} $$ Unos viajes largos $[_{R_4$ Longe viages $]$} $$ Viajes largos $[_{R_1$ Un governamento $]$ non democratic} $$ Un gobierno no democrático $[_{R_1$ Un governamentos $]$ non democratic} $$ Unos gobiernos no democráticos Tú $[_{R_4$ melior ideales $]$} $$ Tu mejores ideales Uno $[_{R_4$ buen solution $]$} $$ Una buena solución

source: Sembla que reconeix la seqüència (1) { art}--{ subst} i propaga el nombre i el gènere del substantiu a l'adjectiu.
es: Parece que reconoce la secuencia (1) { arte}--{ subst} y propaga el número y el género del sustantivo al adjetivo.

source: Sembla que reconeix la seqüència (2) { art}--{ subst}--{ adj} i propaga el nombre i el gènere del substantiu tant a l'article com a l'adjectiu, { Nos ofreció un buen postre} $$ { *Ens va oferir un bon postres}: No funciona.
es: Parece que reconoce la secuencia (2) { arte}--{ subst}--{ adj} y propaga el número y el género del sustantivo tanto al artículo como el adjetivo, { Nos ofreció un buen postre} $$ { Nos ofreció un buen postres}: No funciona.

source: Set.
es: Siete.

source: Si el cim de la pila és
es: Si la cumbre de la pila es

source: Si es vol mantenir el disseny de transferència sintàctica, la única solució és que les regles per a aquestes transformacions depenguen del component lèxic (en aquest cas, un verb) concret.
es: Si se quiere mantener el diseño de transferencia sintáctica, la única solución es que las reglas para estas transformaciones dependan del componente léxico (en este caso, un verbo) concreto.

source: Si fóra un sistema de transferència seria necessària la participació d'experts bilingües en swahili i cada una de les quinze llengües que ja hi ha en el sistema.
es: Si fuera un sistema de transferencia sería necesaria la participación de expertos bilingües en swahili y cada una de las quince lenguas que ya hay en el sistema.

source: Si haguéreu de supervisar la construcció dels diccionaris d'un sistema de traducció automàtica, per a què us podrien servir aquestes constatacions estadístiques?
es: Si tuvierais que supervisar la construcción de los diccionarios de un sistema de traducción automática, ¿para qué os podrían servir estas constataciones estadísticas?

source: Si no es pot aplicar un reordenament al primer mot pendent de processar, es tradueix aïlladament i es continua amb el següent mot.
es: Si no se puede aplicar un reordenamiento a la primera palabra pendiente de procesar, se traduce aisladamente y se continúa con la siguiente palabra.

source: Si s'aplica primer la regla $R_1$ a ``tall truck'' ja no podem aplicar-hi la $R_2$.
es: Si se aplica primero la regla $R_1$ a ``tall truck'' ya no podemos aplicar la $R_2$.

source: Si s'hi aplica primer la $R_2$ i després la $R_1$, s'obté la traducció correcta: ``conductor alt de camió''.
es: Si se aplica primero la $R_2$ y después la $R_1$, se obtiene la traducción correcta: ``conductor alto de camión''.

source: Si tenim ``tall gasoline truck driver'' (``conductor alt de camió de gasolina''), no hi ha cap ordre d'aplicació de $R_2$ i $R_1$ que done una traducció acceptable.
es: Si tenemos ``tall gasoline truck driver'' (``conductor alto de camión de gasolina''), no hay ningún orden de aplicación de $R_2$ i $R_1$ que dé una traducción aceptable.

source: Si volem afegir-hi una cinquena llengua perquè traduïsca en qualsevol sentit entre cinc llengües, quants mòduls nous cal escriure?
es: Si queremos añadir una quinta lengua porque traduzca en cualquier sentido entre cinco lenguas, ¿cuántos módulos nuevos hay que escribir?

source: Si, en canvi, tenim un sistema de TA per transferència sintàctica i suposem que la gramàtica conté les regles següents, ) prediu molts aspectes de les llengües naturals postulant l'existència d'un conjunt de regles universals molt senzilles o principis amb variacions que en cada llengua estan determinades per paràmetres; la gramàtica que es considera en aquesta discussió no és, en principi, la postulada per aquesta formulació, sinó una adequada per a la tasca concreta.}: ${SN} {SG}{SN}$, ${SN} {A}{SN}$, ${SN} {N}$ i ${SG} {SN}{GS}$, on ${SN}$ és un sintagma nominal, ${SG}$ un ``sintagma de genitiu'', ${A}$ un adjectiu, ${N}$ un substantiu i ${GS}$ la partícula de genitiu saxó ('s, '), l'estructura d'aquest sintagma nominal es podria representar, usant un arbre d'anàlisi sintàctica (sense tenir en compte els determinants, per a simplificar) com es veu en la fig. .
es: Si, en cambio, tenemos un sistema de TA por transferencia sintáctica y suponemos que la gramática contiene las reglas siguientes, ) predice muchos aspectos de las lenguas naturales postulando la existencia de un conjunto de reglas universales muy sencillas o principios con variaciones que en cada lengua están determinados por parámetros; la gramática que se considera en esta discusión no es, en principio, la postulada por esta formulación, sino una adecuada para la tarea concreta.}: ${SN} {SG}{SN}$, ${SN} {A}{SN}$, ${SN} {N}$ y ${SG} {SN}{GS}$, on ${SN}$ es un sintagma nominal, ${SG}$ un ``sintagma de genitivo'', ${A}$ un adjetivo, ${N}$ un sustantivo y ${GS}$ la partícula de genitivo sajón ('s, '), la estructura de este sintagma nominal se podría representar, usando un árbol de análisis sintáctico (sin tener en cuenta los determinantes, para simplificar) como se ve en la fig. .

source: Solucions
es: Soluciones

source: Sí, si es tracta de oracions en què aquesta ambigüitat es deu a mots polisèmics i el programa té un diccionari prou complet.
es: Sí, si se trata de oraciones en que esta ambigüedad se debe a palabras polisémicas y el programa tiene un diccionario bastante completo.

source: TEXT META:
es: TEXTO META:

source: TEXT ORIGEN:
es: TEXTO ORIGEN:

source: Tenim un sistema de traducció automàtica multilingüe que tradueix en qualsevol direcció entre les llengües que considera.
es: Tenemos un sistema de traducción automática multilingüe que traduce en cualquier dirección entre las lenguas que considera.

source: Tenint en compte les llengües implicades, argumenteu a favor i en contra d'usar un sistema d'interlingua clàssic (amb anàlisi semàntica profunda) o un sistema de transferència, indicant en cada cas com haurien de ser les representacions intermèdies usades.
es: Teniendo en cuenta las lenguas implicadas, argumentáis a favor y en contra de usar un sistema de interlingua clásico (con análisis semántico profundo) o un sistema de transferencia, indicando en cada caso como tendrían que ser las representaciones intermedias usadas.

source: Tipus de canvis (per exemple, català$$espanyol$$català): Canvi d'un mot per un sinònim per causa de l'elecció diferent d'equivalents en un sentit i en un altre, darrer$$último$$últim o fins i tot per un que no ho és, direcció$$dirección$$adreça.
es: Tipos de cambios (por ejemplo, catalàn$$español$$catalàn): Cambio de una palabra por un sinónimos por causa de la elección diferente de equivalentes en un sentido y en otro. darrer$$último$$últim o incluso por uno que no lo es, direcció$$dirección$$adreça.

source: Tot això permet representar l'analitzador morfològic com el que els matemàtics anomenen graf dirigit acíclic (GDA).
es: Todo esto permite representar el analizador morfológico como lo que los matemáticos llaman grafo dirigido acíclico (GDA).
